package com.example.firtstactivity;

import android.content.Context;

import androidx.core.content.res.ResourcesCompat;

import java.util.ArrayList;
import java.util.List;

public class DataFakeGenerator {
    public static List<ClothesModel> getData(Context context) {
        List<ClothesModel> posts = new ArrayList<>();
        for (int i = 1; i <= 6; i++) {
            ClothesModel postModel = new ClothesModel();
            postModel.setId(i);
            postModel.setTitle("انواع لباس های زمستانی");
            postModel.setDate("2 ساعت پیش");

            switch (i) {
                case 1:
                    postModel.setPostImage(ResourcesCompat.getDrawable(context.getResources(), R.drawable.image1, null));
                    postModel.setContent("لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.");
                    break;
                case 2:
                    postModel.setPostImage(ResourcesCompat.getDrawable(context.getResources(), R.drawable.image2, null));
                    postModel.setContent("هوا کم\u200Cکم دارد رو به سردي مي\u200Cرود و ديگر وقتش رسيده که مثل هرسال، دنبال لباس\u200Cهايي باشيم که براي مقابله با سرماي زمستان، مناسب\u200Cترند. اما به غير از کودکان که از سنگيني و دست\u200Cوپاگيري لباس\u200Cهاي زمستاني خوش\u200Cشان نمي\u200Cآيد، بزرگ\u200Cترهايي هم هستند که حاضرند از سرما بلرزند ولي لباس زمستاني را خصوصا در");
                    break;
                case 3:
                    postModel.setPostImage(ResourcesCompat.getDrawable(context.getResources(), R.drawable.image3, null));
                    postModel.setContent("لباس\u200Cهاي زير گرمي بپوشيد که کاملا اندازه و مناسب اندام شما است. اين گونه لباس\u200Cها درحالي که بدن شما را بدون ايجاد حجم اضافي در برابر سرما مقاوم مي\u200Cکند، تهويه خوبي نيز دارد و ضمنا هر چه تعداد لايه\u200Cهاي لباس کمتري بپوشيد، لاغرتر به نظر مي\u200Cرسيد. لباس زير شما بايد تنگ و چسب باشد تا تقريبا مانند يک");
                    break;
                case 4:
                    postModel.setPostImage(ResourcesCompat.getDrawable(context.getResources(), R.drawable.image4, null));
                    postModel.setContent("لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.");
                    break;
                case 5:
                    postModel.setPostImage(ResourcesCompat.getDrawable(context.getResources(), R.drawable.image5, null));
                    postModel.setContent("لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.");
                    break;
                case 6:
                    postModel.setPostImage(ResourcesCompat.getDrawable(context.getResources(), R.drawable.image6, null));
                    postModel.setContent("لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.");
                    break;

            }
            posts.add(postModel);
        }
        return posts;
    }
}
